Backend/app/views/donations/_form.html.erb

  <div class="field">
    <%= select(:donation, :blood_group_id, BloodGroup.all.collect {|p| [ p.group, p.id ] }, {include_blank: 'None'}) %>
---
SELECT "blood_groups".* FROM "blood_groups"