Backend/app/controllers/donations_controller.rb

  def index
    @donations = Donation.all
---
SELECT "donations".* FROM "donations"

  def create
    @donation = Donation.new(donation_params)

    respond_to do |format|
      if @donation.save
---
INSERT INTO "donations" ("blood_group_id", "created_at", "institution_id", "notes", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["blood_group_id", 3], ["created_at", "2014-11-22 15:50:15.013725"], ["institution_id", 1], ["notes", "fefw"], ["updated_at", "2014-11-22 15:50:15.013725"], ["user_id", 2]]

  def destroy
    @donation.destroy
---
DELETE FROM "donations" WHERE "donations"."id" = $1  [["id", 1]]

    def set_donation
      @donation = Donation.find(params[:id])
---
SELECT  "donations".* FROM "donations"  WHERE "donations"."id" = $1 LIMIT 1  [["id", 3]]