Backend/app/controllers/donors_controller.rb

  def index
    @donors = Donor.all
---
SELECT "donors".* FROM "donors"

  def create
    @donor = Donor.new(donor_params)

    respond_to do |format|
      if @donor.save
---
INSERT INTO "donors" ("created_at", "date_of_last_donation", "email", "encrypted_password", "first_name", "last_name", "locked", "note", "push_reg_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    respond_to do |format|
      if @donor.update(donor_params)
---
UPDATE "donors" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "donors"."id" = 2  [["encrypted_password", "$2a$10$umXS4vUvbH9C.hiyA11E7.gMd5cQ7oMCVCBwF8GoSdug.OE1P6w9."], ["updated_at", "2014-11-22 20:25:00.915282"]]

    def set_donor
      @donor = Donor.find(params[:id])
---
SELECT  "donors".* FROM "donors"  WHERE "donors"."id" = $1 LIMIT 1  [["id", 2]]